---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSmooth
source: html/a230607e-0a7e-ea0b-9c5b-9ef97c6a22e2.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSmooth Property

The property labeled "Smooth" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoiseSmooth { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".